app/lib/queue_worker.rb

SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'uACc_QlVMCAb4g' LIMIT 1
---
  def self.run
    connection = Bunny.new(hostname: "rabbitmq:5672", automatically_recover: true)
    connection.start

    channel = connection.create_channel
    queue = channel.queue('jobs')

    channel.prefetch(1)

    begin
      queue.subscribe(manual_ack: true, block: true) do |delivery_info, _properties, body|
        parsed_message_body = JSON.parse(body)

        if parsed_message_body.key? "message"
          parent_application = ClientApplication.find_by_identifier_token(parsed_message_body["message"]["application_token"])
          self.handle_message(parent_application, parsed_message_body)
        else
          parent_application = ClientApplication.find_by_identifier_token(parsed_message_body["chat"]["application_token"])

INSERT INTO `chat_messages` (`application_chat_id`, `identifier_number`, `created_at`, `updated_at`, `text`, `lock_version`) VALUES (1, 1, '2019-07-23 11:36:41', '2019-07-23 11:36:41', 'test message', 0)
---
  def self.create_message(parent_chat, parsed_message_body)
    parent_chat.messages.create(
        text: parsed_message_body["message"]["text"],
        identifier_number: parsed_message_body["message"]["number"]
    )

INSERT INTO `application_chats` (`client_application_id`, `identifier_number`, `created_at`, `updated_at`, `lock_version`) VALUES (1, 1, '2019-07-23 11:34:37', '2019-07-23 11:34:37', 0)
---
  def self.create_chat(parent_application, parsed_message_body)
    parent_application.chats.create(identifier_number: parsed_message_body["chat"]["number"])