app/workers/queue_worker.rb

  def work(queued_job)
    parsed_message_body = JSON.parse(queued_job)

    if parsed_message_body.key? "message"
      parent_application = ClientApplication.find_by_identifier_token(parsed_message_body["message"]["application_token"])
      handle_message(parent_application, parsed_message_body)
    else
      parent_application = ClientApplication.find_by_identifier_token(parsed_message_body["chat"]["application_token"])
---
SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'yo4YQeTw8KvnqA' LIMIT 1
SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'WMIPmyXUIcs9ew' LIMIT 1

  def create_message(parent_chat, parsed_message_body)
    parent_chat.messages.create(
        text: parsed_message_body["message"]["text"],
        identifier_number: parsed_message_body["message"]["number"]
    )
---
INSERT INTO `chat_messages` (`application_chat_id`, `identifier_number`, `created_at`, `updated_at`, `text`, `lock_version`) VALUES (10, 1, '2019-07-23 16:30:15', '2019-07-23 16:30:15', 'test message', 0)

  def create_chat(parent_application, parsed_message_body)
    parent_application.chats.create(identifier_number: parsed_message_body["chat"]["number"])
---
INSERT INTO `application_chats` (`client_application_id`, `identifier_number`, `created_at`, `updated_at`, `lock_version`) VALUES (1, 1, '2019-07-23 14:34:17', '2019-07-23 14:34:17', 0)

  def increment_parent_application_chat_count(parent_application)
    parent_application.chat_count += 1
    parent_application.save
---
UPDATE `application_chats` SET `message_count` = 1, `updated_at` = '2019-07-23 16:30:15', `lock_version` = 1 WHERE `application_chats`.`id` = 10 AND `application_chats`.`lock_version` = 0