app/controllers/application_chats_controller.rb

  def index
    parent_application = ClientApplication.find_by_identifier_token(params[:application_token])
---
SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'lN7pA_ZX8gkNvQ' LIMIT 1

  def create
    parent_application = ClientApplication.find_by_identifier_token(params[:application_token])
    handle_error_for("application token") and return unless parent_application

    created_chat = parent_application.chats.create
---
SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'AgdhhMyyVcdvUg' LIMIT 1
INSERT INTO `application_chats` (`client_application_id`, `identifier_number`, `created_at`, `updated_at`) VALUES (240, 1, '2019-07-20 08:17:15', '2019-07-20 08:17:15')

  def update
    parent_application = ClientApplication.find_by_identifier_token(params[:application_token])
    handle_error_for("application token") and return unless parent_application

    application_chat = parent_application.chats.find_by(:identifier_number => params[:chat_number])
    handle_error_for("chat number") and return unless application_chat

    application_chat.update(chat_params)
---
SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'D59yiuHkclQv4w' LIMIT 1
UPDATE `application_chats` SET `modifiable_attribute` = 'new value' WHERE `application_chats`.`id` = 125

  def show
    parent_application = ClientApplication.find_by_identifier_token(params[:application_token])
---
SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'lN7pA_ZX8gkNvQ' LIMIT 1