app/controllers/application_chats_controller.rb

SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'AgdhhMyyVcdvUg' LIMIT 1
---
  def verify_application_token
    @parent_application = ClientApplication.find_by_identifier_token(params[:client_application_token])