app/controllers/chat_messages_controller.rb

SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'lN7pA_ZX8gkNvQ' LIMIT 1
---
  def index
    parent_application = ClientApplication.find_by_identifier_token(params[:client_application_token])

SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'lN7pA_ZX8gkNvQ' LIMIT 1
SELECT  `chat_messages`.* FROM `chat_messages` WHERE `chat_messages`.`application_chat_id` = 1 AND `chat_messages`.`identifier_number` = 1 LIMIT 1
---
  def show
    parent_application = ClientApplication.find_by_identifier_token(params[:client_application_token])
    handle_error_for("application token") and return unless parent_application

    parent_chat = parent_application.chats.find_by(:identifier_number => params[:application_chat_number])
    handle_error_for("chat number") and return unless parent_chat

    chat_message = parent_chat.messages.find_by(:identifier_number => params[:number])