app/controllers/chat_messages_controller.rb

SELECT `chat_messages`.* FROM `chat_messages` WHERE 1=0
---
  def get_all_messages_with_required_text
    @parent_chat.messages.search(params[:text] || '').records.to_a

SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'AgdhhMyyVcdvUg' LIMIT 1
---
  def verify_application_and_chat_tokens
    @parent_application = ClientApplication.find_by_identifier_token(params[:client_application_token])