app/controllers/chat_messages_controller.rb

  def verify_application_and_chat_tokens
    @parent_application = ClientApplication.find_by_identifier_token(params[:client_application_token])
---
SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'h8STkYaviFCKmw' LIMIT 1