app/controllers/client_applications_controller.rb

  def create
    client_application = ClientApplication.new(:name => client_application_params)
    client_application.save
---
INSERT INTO `client_applications` (`name`, `identifier_token`, `created_at`, `updated_at`) VALUES ('first app', 'AgdhhMyyVcdvUg', '2019-07-23 10:39:27', '2019-07-23 10:39:27')

  def show
    client_application = ClientApplication.find_by_identifier_token(params[:token])
---
SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'lN7pA_ZX8gkNvQ' LIMIT 1

  def update
    client_application = ClientApplication.find_by_identifier_token(params[:token])
    handle_entity_not_found and return unless client_application

    client_application.update(:name => client_application_params)
---
SELECT  `client_applications`.* FROM `client_applications` WHERE `client_applications`.`identifier_token` = 'lN7pA_ZX8gkNvQ' LIMIT 1
UPDATE `client_applications` SET `name` = 'another app name', `updated_at` = '2019-07-23 16:20:04' WHERE `client_applications`.`id` = 1